'''
문제
 -박성원은 이 문제를 풀지 못했다.
입력
 -첫째 줄에 집합의 수의 개수 N이 주어진다. N은 15보다 작거나 같은 자연수이다. 둘째 줄부터 N개의 줄에는 집합에 포함된 수가 주어진다. 각 수의 길이는 길어야 50인 자연수이다. 마지막 줄에는 K가 주어진다. K는 100보다 작거나 같은 자연수이다.
출력
 -첫째 줄에 정답을 기약분수 형태로 출력한다. p/q꼴로 출력하며, p는 분자, q는 분모이다. 정답이 0인 경우는 0/1로, 1인 경우는 1/1로 출력한다.
예제 입력 1
 -3
3
2
1
2

예제 출력 1
 -1/3

예제 입력 2
 -5
10
100
1000
10000
100000
10

예제 출력 2
 -1/1

예제 입력 3
 -5
11
101
1001
10001
100001
10

예제 출력 3
 -0/1

예제 입력 4
 -9
13
10129414190271203
102
102666818896
1216
1217
1218
101278001
1000021412678412681
21

예제 출력 4
 -5183/36288

'''