'''
문제
 -강호네 회사에는 직원이 N명이 있고, 해야할 일이 M개가 있다. 직원은 1번부터 N번까지 번호가 매겨져 있고, 일은 1번부터 M번까지 번호가 매겨져 있다.
입력
 -첫째 줄에 직원의 수 N과 일의 개수 M, 지난달에 받은 벌점의 합 K가 주어진다. (1 ≤ N, M ≤ 1,000, 1 ≤ K ≤ N)
출력
 -첫째 줄에 강호네 회사에서 할 수 있는 일의 개수를 출력한다.
예제 입력 1
 -5 5 1
5 1 2 3 4 5
1 1
1 1
1 1
2 1 5

예제 출력 1
 -4

예제 입력 2
 -5 5 2
5 1 2 3 4 5
1 1
1 1
1 1
2 1 5

예제 출력 2
 -5

예제 입력 3
 -5 5 3
5 1 2 3 4 5
1 1
1 1
1 1
2 1 5

예제 출력 3
 -5

예제 입력 4
 -5 5 5
5 1 2 3 4 5
1 1
1 1
1 1
2 1 5

예제 출력 4
 -5

https://www.acmicpc.net//problem/11378
'''