'''
문제
 -666은 종말을 나타내는 숫자라고 한다. 따라서, 많은 블록버스터 영화에서는 666이 들어간 제목을 많이 사용한다. 영화감독 숌은 세상의 종말 이라는 시리즈 영화의 감독이다. 조지 루카스는 스타워즈를 만들 때, 스타워즈 1, 스타워즈 2, 스타워즈 3, 스타워즈 4, 스타워즈 5, 스타워즈 6과 같이 이름을 지었고, 피터 잭슨은 반지의 제왕을 만들 때, 반지의 제왕 1, 반지의 제왕 2, 반지의 제왕 3과 같이 영화 제목을 지었다.
입력
 -첫째 줄에 숫자 N이 주어진다. N은 10,000보다 작거나 같은 자연수이다.
출력
 -첫째 줄에 N번째 영화의 제목에 들어간 수를 출력한다.
예제 입력 1
 -2

예제 출력 1
 -1666

예제 입력 2
 -3

예제 출력 2
 -2666

예제 입력 3
 -6

예제 출력 3
 -5666

예제 입력 4
 -187

예제 출력 4
 -66666

예제 입력 5
 -500

예제 출력 5
 -166699

https://www.acmicpc.net//problem/1436
'''